import React, { Component } from 'react';
import {
  AppRegistry,
  StyleSheet,
  Text,
  Alert,
  View,
  FlatList,
  Platform,
  TouchableOpacity,
  Image,
  TextInput,
  ScrollView,
  Dimensions,
} from 'react-native';

var Header=require('./Header');
var personImage=require('./Icons/person.png')
const window = Dimensions.get('window');




class IntroductionScreen extends Component{

  constructor(props){
    super(props);
    this.props.navigator.setOnNavigatorEvent(this.onNavigationEvent.bind(this));

  }



  onNavigationEvent(event) {
	// handle a deep link
		if (event.type == 'DeepLink') {
			const parts = event.link;
			if (parts=='Home') {
				console.log(parts);
				return;
			}else{
    				this.props.navigator.resetTo({
    			  screen: parts,
    				navigatorStyle: {
    					navBarHidden:true,
    				},
    			});
			  }
		}
	}








render(){

  return(
    <View style={styles.outerContainer}>
    <Header navigator={this.props.navigator} showMenu={true} title='ادارہ سلیمانی'/>
    <ScrollView style={styles.scrollStyle}>

    <Image source={personImage} style={styles.imageStyle}/>
    <Text style={styles.textStyle}>
    حکیم محمد عبداللہ کے صاحبزادے حکیم عبدالوحید سلیمانی نے 1968ء میں پنجاب یونیورسٹی ، لاہور سے فارمیسی اور اسلامیات کی تعلیم کے حصول کے بعد جہانیاں سے عملی زندگی کا آغاز کیا اور کتب و ادویہ کی فروخت اور ترسیل کے لیے ادارہ سلیمانی کی بنیاد رکھی ۔26 مارچ 1971ء کو نئے انتظامات کے ساتھ خواص شہد سے سلسلہ طباعت کا دوبارہ آغاز ہوا، خواص شہد اپنی اشاعت کے بعد دو ماہ کی قلیل مدت میں فروخت ہو گئی۔ اپریل 1971ء میں حکیم محمد عبداللہؒ نے اپنی کتب کے اشاعتی حقوق ادارہ سلیمانی کے ذیلی شعبہ مطبوعات کو منتقل کر دیے۔ یوں دارالکتب سلیمانی )روڑی ، ہندوستان( اور مکتبہ سلیمانی )جہانیاں( کے ناموں سے ہوتے ہوئے’’ادارہ مطبوعات سلیمانی‘‘ وجود میں آیا۔ اگست 1974ء میں انتظامی امور کے باعث ادارہ لاہور منتقل ہو گیا۔ اپنے والد گرامی کے فروغ علم و طبکے مقاصد کے پیش نظر حکیم عبدالوحیدسلیمانی نے حکیم محمد عبد اللہ اور دیگر اطباء کی تصانیف کو اضافہ جات و ترامیم کے ساتھ دیدہ زیب اور جدید انداز میں طبع کروایا۔ان گراں قدر اور نایاب طبی کتب کی اشاعت سے ادارہ نے ملک کے طبی اداروں میں نمایاں ترین مقام حاصل کر لیا۔ آپکی چالیس سالہ محنت شاقہ کے نتیجے میں اعتماد اور معیار ادارہ مطبوعات سلیمانی کی شناخت بن گئے۔ اپنے اسلاف کی پیروی میں 1971ء سے آپ نے مطب کا آغاز کیا اور خوشنودی رب کے لیے فی سبیل اللہ طبی مشورہ کے ذریعے خدمت خلق کو اب تلک اپنا شعار بنائے ہوئے ہیں۔ آپ پاکستان کے مختلف علاقوں میں پائی جانے والی جڑی بوٹیوں کی تحقیق کے لیے سیر و سیاحت میں دلچسپی رکھتے ہیں۔ آپکے عام فہم طبی مضامین اردو ڈائجسٹ، روزنامہ اسلام وغیرہ میں چھپتے رہے ہیں۔ یہ مضامین بعد ازاں انڈیا، بنگلہ دیش، دبئی، امریکہ اور فلپائن کے رسائل و جرائد میں ترجمہ ہوکر شائع ہوئے۔
{'\n'}
      اللہ کے فضل اور اطباء کے تعاون سے ادارہ کے قیام سے اب تک ہمیں جو شہرت اور نیک نامی نصیب ہوئی ہے، وہ بہت کم اداروں کے حصے میں آتی ہے۔ آپ کا یہی اعتماد بفضلہ تعالی ہماری بقا کا ضامن ہے۔ حکیم محمد عبداللہؒ مرحوم نےفروغ ِعلم و طب کو عبادت سمجھا اور یہی فکر انکے ورثاء میں بھی بدرجہ اتم موجود ہے۔ ادارہ کی شائع کردہ کتب کی مقبولیت اللہ جل شانہ کی عطا ہے۔ محدود وسائل و ذرائع کے باوجود ادارہ پختہ عزم اور لگن کے ساتھ اپنے مقاصد پر کاربند ہے۔ ادارہ اپنی اساس میں علم و حکمت کے فروغ کو جلب زر اور منافع پر مقدم رکھتا ہے۔ ہمیں فخر ہے کہ طب یونانی پر تن تنہا ہمارا کام کسی بڑے ادارے سے کم نہیں۔ اور ان شاء اللہ یہ سلسلہ جاری رہے گا۔
{'\n'}
      فن طب اور اشاعت طب ہمارا خاندانی ورثہ اور ہماری تخصیص ہے۔ ادارہ مطبوعات سلیمانی کا اساسی مقصد ہر خاص و عام کوارزاں، معیار ی اور مستند طبی و علمی کتب کی فراہمی کے ذریعے علم و صحت کا فروغ ہے۔ ہماری مطبوعات میں مجربات‘ مرکبات‘ معالجات‘ دوا سازی‘ آیورویدک‘ کشتہ جات اور طبی نصاب اور دیگر علمی ادبی موضوعات پر 300 کے قریب معیاری کتب شامل ہیں۔ اس طرح ادارہ احیائے طب یونانی کا سرخیل ثابت ہوا ہے۔ جون 2009 سے ہم نے ادبیات کے نام سے ایک نئے ادارہ کا آغاز کر دیا ہے۔ ادبیات کے تحت اسلامی، علمی و ادبی، تاریخی اور ادب اطفال کے موضوعات پر اب تک دو درجن سے زائد کتب شائع کی جا چکی ہیں۔ ان شاء اللہ اس میدان میں بھی ہم اپنی روایات قائم رکھیں گے۔ ادارہ مقصدی اور تعمیری ادب کا قائل ہے اورایسی کتب کی اشاعت کرتا ہے جس سے مطالعہ کا صحیح ذوق، فن میں ترقی، صحت فکری و جسمانی اور سماجی شعور میں اضافہ ہو۔ہمارا زاویہء نگاہ یہ ہے کہ اعلی تحقیقی اور تصنیفی مواد پر مشتمل کتاب عام فہم، دلچسپ نفس مضمون کی حامل اور اغلاط سے پاک ہو، کتابت دلکش، طباعت دیدہ زیب، کاغذ نفیس و عمدہ، جلد مضبوط اور گردپوش جاذب نظر ہو۔ گویا کہ کتاب ظاہری و باطنی حسن کا ایک پیکر جمیل ہو۔ ادارہ کے کار پردازان کا حسن ذوق انہیں استناد اور معیار عطا کرنے کی ہرممکن کوشش کرتا ہے۔

      بین الاقوامی سطح پر طب یونانی کے فروغ کے لیے حکیم محمد عبداللہؒ مرحوم اور دیگر نامور اطباء کی کتب کے انگریزی، چینی، عربی، فارسی اور دیگر عالمی زبانوں میں تراجم کی اشد ضرورت ہے۔ اگر آپ یا آپکے حلقہ میں کوئی صاحب طب یونانی سے شناسا ہوں اور کسی عالمی زبان میں مستند اور بامحاورہ ترجمے کی صلاحیت رکھتے ہوں تو ادارہ کے شعبہء تصنیف و تالیف سے رابطہ کریں۔ اسکے ساتھ ادارہ اہم موضوعات پر معروف طبی مصنفین کی نادر و نایاب کتب،مسودات اور پرانے طبی رسائل کی عکسی نقول تک رسائی کو یقینی بنانے اور طب و صحت کی معلومات کو عام فہم انداز میں اشاعت کے لیے اطلاعاتی اور کمیونیکیشن ٹیکنالوجی (ICT) کے استعمال کا ارادہ رکھتا ہے۔ اس مقصدکے لیے ہمیں طبی کتب کی لائبریری کی ضرورت بڑی شدت سے محسوس ہو رہی ہے۔ اگر آپ نایاب طبی کتب‘ رسائل یا مسودات ہمیں ارسال کریں گے تو خدمت خلق کے اس وسیع کام میں آپکا بھی حصہ ہو جائے گا۔مفید ثابت ہونے پر ہم آپکو انکا معقول معاوضہ دیں گے۔ جو صاحبان عاریتاً کتب یا رسائل ارسال کریں گے، استفادہ کے بعد انکو وہ بحفاظت واپس کر دی جائیں گی۔ ہمیں اطباء اور اہل علم حضرات سے امید رکھتے ہیں کہ فروغ علم و حکمت کے اس سفر میں ہمارے ساتھ اپنا گراں قدر تعاون جاری رکھیں گے۔ ہم مصنّفین و اطباء کی قابل قدر علمی کاوشوں‘ تحقیقات ومجربات کو خوش آمدید کہتے ہیں۔ اگر آپ کے پاس کوئی قابل اشاعت کتاب یا مسودہ موجود ہے اور آپ اسے طبع کرانے میں دلچسپی رکھتے ہیں تو ہمارے شعبہ تصنیف و تالیف سے رابطہ کیجیے۔ فروغ طب کے لئے ابھی بہت کچھ کرنا باقی ہے۔ اللہ کرے کہ علم دوست اور بخل شکن ادارے کی حیثیت سے ہم ملکی اور بین الاقوامی سطح پرعلم و طب کے فروغ کا ذریعہ بن سکیں۔ مزید بہتری کے کے لیے آپکی آراء و تجاویز کےمنتظر۔
{'\n'}
      سرپرست اعلی: حکیم عبدالوحید سلیمانی
      {'\n'}
      معاونین: حکیم طلحہ وحید سلیمانی، حکیم عروہ وحید سلیمانی، حکیم عمار وحید سلیمانی


    </Text>

    </ScrollView>

    </View>
  )

}
}


const styles=StyleSheet.create({
outerContainer:{
  flex:1,
  backgroundColor:'white',
},
scrollStyle:{
  flex:1,

},
imageStyle:{

  backgroundColor:'green',
  width: window.width-30,
  height:window.width-180,
  marginLeft:15,
},
textStyle:{
  marginTop:20,
  paddingLeft:15,
  paddingRight:15,
  textAlign:'right',
  fontSize:20,
  lineHeight:35,
  fontFamily:'Nafees Web Naskh',
  marginBottom:40,
}

})


module.exports=IntroductionScreen;
